In [3]:
import pandas as pd
import numpy as np

Create Data using numpy

In [4]:
data=np.arange(0,20)
#reshape this rray into a matrix
data=data.reshape(5,4) #5 rows and 4 columns

Creating DataFrame

In [5]:
df=pd.DataFrame(data,index=["Row1","Row2","Row3","Row4","Row5"],columns=["Col1","Col2","Col3","Col4"])
print(df)

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

Check for the First 5 Rows and first 5 columns

In [6]:
df.head()   #display first 5 rows of dataFrame

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [7]:
df.tail() #display lst five rows of dataFrame

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [8]:
#can be customized to display any number of rows
df.head(2) #dispay first 2 rows

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7

In [9]:
df.tail(2) #last 2 rows

      Col1  Col2  Col3  Col4
Row4    12    13    14    15
Row5    16    17    18    19

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col1    5 non-null      int32
 1   Col2    5 non-null      int32
 2   Col3    5 non-null      int32
 3   Col4    5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [12]:
df.describe()

            Col1       Col2       Col3       Col4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

Indexing using Column Names

In [13]:
#use single brackets when acess only one column
df["Col1"]

Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: Col1, dtype: int32

In [14]:
#we use nested brackets when we have to access more than 1 column
df[["Col1","Col2"]]

      Col1  Col2
Row1     0     1
Row2     4     5
Row3     8     9
Row4    12    13
Row5    16    17

Indexing using Row Names (loc)

In [15]:
df.loc["Row1"] #single row

Col1    0
Col2    1
Col3    2
Col4    3
Name: Row1, dtype: int32

In [16]:
df.loc[["Row1","Row2"]] #multiple row

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7

Accessing by proper index number

In [17]:
df.head()

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [18]:
df.iloc[2:4,0:2] #element from 2nd row to 3rd and oth olumn to 1st

      Col1  Col2
Row3     8     9
Row4    12    13

In [19]:
df.iloc[2:,1:]

      Col2  Col3  Col4
Row3     9    10    11
Row4    13    14    15
Row5    17    18    19

In [20]:
df.head()

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [21]:
df.iloc[0:,3:]

      Col4
Row1     3
Row2     7
Row3    11
Row4    15
Row5    19

In [22]:
df.head()

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

#Convert dataframe into array

In [23]:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

Basic Operations

In [24]:
#check if there is null values in df
df.isnull().sum()

Col1    0
Col2    0
Col3    0
Col4    0
dtype: int64

In [25]:
df1 = pd.DataFrame(
    data=[[1, np.nan, 2], [4, 5, 6]],
    index=["Row1", "Row2"],
    columns=["col1", "col2", "col3"]
)
df1

      col1  col2  col3
Row1     1   NaN     2
Row2     4   5.0     6

In [26]:
df1.isnull().sum()

col1    0
col2    1
col3    0
dtype: int64

In [27]:
df1.isnull()

       col1   col2   col3
Row1  False   True  False
Row2  False  False  False

In [28]:
df.head()

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [29]:
df["Col3"].value_counts() #ount for particular values occured in a column

Col3
2     1
6     1
10    1
14    1
18    1
Name: count, dtype: int64

# Working with industry.csv file using pandas

In [30]:
data=pd.read_csv("C:\PYTHON- Tutorial\PYTHON-Libraries\industry.csv")

In [31]:
data.head()

                        Industry
0             Accounting/Finance
1   Advertising/Public Relations
2             Aerospace/Aviation
3  Arts/Entertainment/Publishing
4                     Automotive

In [32]:
data.tail()

                    Industry
38             Skilled Labor
39                Technology
40        Telecommunications
41  Transportation/Logistics
42                     Other

In [33]:
col=pd.read_csv("industry.csv",usecols=["Industry"])
col.head()

                        Industry
0             Accounting/Finance
1   Advertising/Public Relations
2             Aerospace/Aviation
3  Arts/Entertainment/Publishing
4                     Automotive

In [34]:
col.to_csv("test.csv")

In [35]:
data=('a,b,c,d\n'
      '1,2,3,4\n'
      '5,6,7,8\n'
      'e,f,g')

data

'a,b,c,d\n1,2,3,4\n5,6,7,8\ne,f,g'

In [36]:
from io import StringIO

df1=pd.read_csv(StringIO(data))

In [37]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      object
 1   b       3 non-null      object
 2   c       3 non-null      object
 3   d       2 non-null      float64
dtypes: float64(1), object(3)
memory usage: 228.0+ bytes

In [38]:
df1=pd.read_csv(StringIO(data),dtype=object)

In [39]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      object
 1   b       3 non-null      object
 2   c       3 non-null      object
 3   d       2 non-null      object
dtypes: object(4)
memory usage: 228.0+ bytes

In [40]:
df1

   a  b  c    d
0  1  2  3    4
1  5  6  7    8
2  e  f  g  NaN

In [41]:
df1.isnull().sum()

a    0
b    0
c    0
d    1
dtype: int64

In [42]:
df1.dtypes

a    object
b    object
c    object
d    object
dtype: object

## Pandas Working with JSON

In [49]:
data='{"name": "sejal","age":20,"email":"sejal@gmail.com","job-profile":[{"role1": "Data scientist","role2": "Data analysts"}]}'

In [50]:
type(data)

str

In [58]:
Sdata=pd.read_json(str(data))

C:\Users\Dell\AppData\Local\Temp\ipykernel_11272\210628911.py:1: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  Sdata=pd.read_json(str(data))

In [59]:
#giving indx as orient make key as index
pd.read_json(str(data),orient='index')

C:\Users\Dell\AppData\Local\Temp\ipykernel_11272\472062736.py:2: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_json(str(data),orient='index')

                                                             0
name                                                     sejal
age                                                         20
email                                          sejal@gmail.com
job-profile  [{'role1': 'Data scientist', 'role2': 'Data an...

In [60]:
df=pd.DataFrame([['a','b'],['c','d']],
                index=['row1','row2'],
                columns=['col1','col2'])

In [61]:
df

     col1 col2
row1    a    b
row2    c    d

### Convert dataframe to json format

In [62]:
df.to_json()

'{"col1":{"row1":"a","row2":"c"},"col2":{"row1":"b","row2":"d"}}'

In [63]:
df.to_json(orient='index')

'{"row1":{"col1":"a","col2":"b"},"row2":{"col1":"c","col2":"d"}}'

In [64]:
df.to_json(orient='columns')

'{"col1":{"row1":"a","row2":"c"},"col2":{"row1":"b","row2":"d"}}'

In [65]:
df.to_json(orient='records')

'[{"col1":"a","col2":"b"},{"col1":"c","col2":"d"}]'

In [66]:
df.to_json(orient='table')

'{"schema":{"fields":[{"name":"index","type":"string"},{"name":"col1","type":"string"},{"name":"col2","type":"string"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":"row1","col1":"a","col2":"b"},{"index":"row2","col1":"c","col2":"d"}]}'

In [67]:
schema={"schema":{"fields":[{"name":"index","type":"string"},{"name":"col1","type":"string"},{"name":"col2","type":"string"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":"row1","col1":"a","col2":"b"},{"index":"row2","col1":"c","col2":"d"}]}